public_html/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-20 vie 12:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">emacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8412204">1. Grandes temas</a>
<ul>
<li><a href="#org5178890">1.1. org-mode</a></li>
<li><a href="#org5d5b0ad">1.2. org-roam</a></li>
<li><a href="#orgdb477a4">1.3. ox-hugo</a></li>
<li><a href="#orgf9e9962">1.4. elisp</a></li>
</ul>
</li>
<li><a href="#orgc9b98da">2. Pequeños temas</a>
<ul>
<li><a href="#org95f4265">2.1. Archivos recientes</a></li>
<li><a href="#orgfe2fe4a">2.2. Arranque</a></li>
<li><a href="#org1b4e064">2.3. Ayuda</a></li>
<li><a href="#org8dbb4d0">2.4. Bookmarks (Favoritos)</a></li>
<li><a href="#org1968732">2.5. Buffers</a></li>
<li><a href="#orga920879">2.6. Busqueda</a></li>
<li><a href="#org460de05">2.7. Corrección Ortográfica y Diccionario</a></li>
<li><a href="#orgffccba6">2.8. Edición</a></li>
<li><a href="#org1c1da01">2.9. Evaluando código (org-babel)</a></li>
<li><a href="#org6e7cdc4">2.10. Macros</a></li>
<li><a href="#orged26152">2.11. MarkDown Mode</a></li>
<li><a href="#orgc360380">2.12. Movimiento del cursor</a></li>
<li><a href="#orgde885b8">2.13. Navegación</a>
<ul>
<li><a href="#orga11b837">2.13.1. Ocur Mode (Buscar por líneas) M-x occur / M-s o</a></li>
</ul>
</li>
<li><a href="#org5f70fa0">2.14. Paquetes</a></li>
<li><a href="#orgd1c2c50">2.15. Repetir último comando (Info] -&gt; C-x z</a></li>
<li><a href="#orga976e27">2.16. Recuperar archivos -&gt; m-x recover-file</a></li>
<li><a href="#org59b872c">2.17. Selección</a></li>
<li><a href="#org6e97116">2.18. Shell</a></li>
<li><a href="#org031b916">2.19. Temas</a></li>
<li><a href="#org462171d">2.20. Ventanas</a></li>
<li><a href="#org87ad94d">2.21. Visualización</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Emacs es un editor de texto reconocido por su amplio conjunto de funciones, lo cual lo ha convertido en una herramienta valorada por programadores y usuarios con orientación técnica. GNU Emacs forma parte del proyecto GNU y destaca como la versión más popular de este editor. El manual de GNU Emacs lo describe como «un editor de texto avanzado, extensible, personalizable y autodocumentado».
</p>

<div id="outline-container-org8412204" class="outline-2">
<h2 id="org8412204"><span class="section-number-2">1.</span> Grandes temas</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5178890" class="outline-3">
<h3 id="org5178890"><span class="section-number-3">1.1.</span> <a href="org_mode.html#ID-d0e0ffd7-78fa-4fe9-a6b2-3a59223169c9">org-mode</a></h3>
</div>
<div id="outline-container-org5d5b0ad" class="outline-3">
<h3 id="org5d5b0ad"><span class="section-number-3">1.2.</span> <a href="org_roam.html#ID-80ce4bf8-3936-45bf-adc9-041795828500">org-roam</a></h3>
</div>
<div id="outline-container-orgdb477a4" class="outline-3">
<h3 id="orgdb477a4"><span class="section-number-3">1.3.</span> <a href="ox_hugo.html#ID-03c84b6d-dee5-473e-822b-5702f535419e">ox-hugo</a></h3>
</div>
<div id="outline-container-orgf9e9962" class="outline-3">
<h3 id="orgf9e9962"><span class="section-number-3">1.4.</span> <a href="elisp.html#ID-a7d5680b-e0d9-44ea-9788-40d2e7a139c6">elisp</a></h3>
</div>
</div>

<div id="outline-container-orgc9b98da" class="outline-2">
<h2 id="orgc9b98da"><span class="section-number-2">2.</span> Pequeños temas</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org95f4265" class="outline-3">
<h3 id="org95f4265"><span class="section-number-3">2.1.</span> Archivos recientes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Para mostrar en el arranque los últimos archivos editados uso esta combinación.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(recentf-mode 1)                   ; Activa el modo recentf
(setq recentf-max-saved-items 50)  ; Ajusta la cantidad de archivos recientes a mostrar.

(add-hook 'after-init-hook (lambda () (recentf-open-files)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe2fe4a" class="outline-3">
<h3 id="orgfe2fe4a"><span class="section-number-3">2.2.</span> Arranque</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Arrancar emacs es modo texto desde la terminal: <code>emacs -nw</code></li>
</ul>
</div>
</div>
<div id="outline-container-org1b4e064" class="outline-3">
<h3 id="org1b4e064"><span class="section-number-3">2.3.</span> Ayuda</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Prefijo, muestra comandos que empiezan por -&gt; "prefijo" C-h f</li>
<li>Atajo, muestra descripción y ayuda (describe-key) -&gt; C-h k</li>
<li>Modo, describe el modo activo (describe-mode) -&gt; C-h m</li>
<li>Funcion, descripción y ayuda (describe-function) -&gt; C-h f</li>
<li>variable, descripción y ayuda (describe-variable) -&gt; C-h v</li>
</ul>
</div>
</div>
<div id="outline-container-org8dbb4d0" class="outline-3">
<h3 id="org8dbb4d0"><span class="section-number-3">2.4.</span> Bookmarks (Favoritos)</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Ubicación -&gt; (setq bookmark-default-file "~/.emacs.d/bookmarks")</li>
<li>Añadir &#x2013;&gt; C-x r m</li>
<li>Listar &#x2013;&gt; C-x r l
<ul class="org-ul">
<li>‘a’ – show annotation for the current bookmark</li>
<li>‘A’ – show all annotations for your bookmarks</li>
<li>‘d’ – mark various entries for deletion (‘x’ – to delete them)</li>
<li>‘e’ – edit the annotation for the current bookmark</li>
<li>‘m’ – mark various entries for display and other operations, (‘v’ – to visit)</li>
<li>‘o’ – visit the current bookmark in another window, keeping the bookmark list open</li>
<li>‘C-o’ – switch to the current bookmark in another window</li>
<li>‘r’ – rename the current bookmark</li>
</ul></li>
<li>Abrir &#x2013;&gt; C-x r b</li>
<li>Archivo de favoritos - bookmarks-default-file</li>
</ul>
</div>
</div>
<div id="outline-container-org1968732" class="outline-3">
<h3 id="org1968732"><span class="section-number-3">2.5.</span> Buffers</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Borrar el buffer completo -&gt; erase-buffer (Sin tecla por defecto)</li>
<li>Actualizar/recargar -&gt; revert-buffer-quick</li>
<li>Actualizar/recargar archivo (revert-buffer) -&gt; C-x C-v Ret</li>
<li>Actualizar/recargar automáticamente un buffer abierto -&gt; auto-revert-mode</li>
<li>Recargar archivo (añade al final) (auto-revert-tail-mode)</li>
<li>Siguiente|anterior buffer (previous-buffer|next-buffer) -&gt; C-x &lt;left&gt; | C-x &lt;right&gt;</li>
<li>Cuardar como (buffer) -&gt; C-x C-w <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Save-Commands.html">Link</a></li>
<li>Guardar como (todo el texto) -&gt; C-x h M-x write-region</li>
<li>Instalar paquete desde buffer -&gt; install-package-from-buffer</li>
<li>Mostrar los números de línea -&gt; linum-mode</li>
<li>Seleccionar el buffer completo -&gt; C-x h</li>
</ul>
</div>
</div>
<div id="outline-container-orga920879" class="outline-3">
<h3 id="orga920879"><span class="section-number-3">2.6.</span> Busqueda</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Buscar (Isearch) -&gt; C-S</li>
<li>Repetir búsqueda -&gt; C-s C-s</li>
<li>Añadir siguiente palabra -&gt; C-w</li>
<li>Volver al inicio -&gt; C-u C-&lt;spc&gt;</li>
</ul>
</div>
</div>
<div id="outline-container-org460de05" class="outline-3">
<h3 id="org460de05"><span class="section-number-3">2.7.</span> Corrección Ortográfica y Diccionario</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Cambiar diccionario -&gt; M-x ispell-change dictionary "castellano"</li>
<li>Instalar diccionario -&gt; <a href="https://ondahostil.wordpress.com/2017/01/17/lo-que-he-aprendido-configurando-aspell-para-emacs/">Onda Hostil</a>
<ul class="org-ul">
<li>Descargarlo de <a href="ftp://ftp.gnu.org/gnu/aspell/dict/">GNU-Aspell</a></li>
<li>Descomprimirlo</li>
<li><p>
Ejecutar lo siguiente desde la carpeta descomprimida
</p>
<div class="org-src-container">
<pre class="src src-bash">./configure
make
sudo make install
make clean
</pre>
</div></li>
</ul></li>
<li>Corregir el buffer -&gt; M-x ispell-minor-mode</li>
<li>Subrayado -&gt; M-x flyspell-mode</li>
</ul>
</div>
</div>
<div id="outline-container-orgffccba6" class="outline-3">
<h3 id="orgffccba6"><span class="section-number-3">2.8.</span> Edición</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>Cadena, reemplazar (replace-string) -&gt; M-%</li>
<li>Caracter, corta hasta (zap-to-char) -&gt; M-z</li>
<li>Carácteres, transponer (transpose-chars) -&gt; C-t</li>
<li>Deshacer (Undo) -&gt; C-/ | C-x u | C-_</li>
<li>Expresiones, transponer (transpose-sexps) -&gt; C-M-t</li>
<li>Expresión regular, reemplazar (replace-regexp) -&gt; C-M-%</li>
<li>Imagen, editar archivos en modo texto &gt; C-c C-c (auto-image-file-mode 1)</li>
<li>Línea, borrar -&gt; C-S-Backspace</li>
<li>Línea, comentar (comment-dwim) -&gt; M-;</li>
<li>Línea, comentar (comment-line) -&gt; C-x C-;</li>
<li>Línea, copiar (Instalar/habilitar paquete whole-line-or-region) -&gt; M-w</li>
<li>Línea, corta completa (Instalar/habilitar paquete whole-line-or-region) -&gt; C-w</li>
<li>Línea, corta hasta el final (kill-line) -&gt; C-k</li>
<li>Línea, corta línea completa (kill-whole-line) -&gt; C-S-&lt;backspace&gt;</li>
<li>Línea, insertaren blanco a continuación, insertar (open-line) -&gt; C-o</li>
<li>Líneas, borrar en blanco (delete-blank-lines) -&gt; C-x C-o</li>
<li>Líneas, ordenar selección (sort-lines) - Artículo en <a href="https://susam.net/blog/sorting-in-emacs.html">Susam.net</a></li>
<li>Líneas, sangrar varias líneas 8 -&gt; C-u 8 C-x Tab</li>
<li>Líneas, transponer líneas (transpose-lines) -&gt; C-x C-t</li>
<li>Oraciones, transponer (transpose-sentences)</li>
<li>Palabra anterior, corta (backward-kill-word) -&gt; M-&lt;back&gt;</li>
<li>Palabra siguiente a mayúsculas (upcase-word) -&gt; M-u</li>
<li>Palabra siguiente a minúsculas (downcase-word) -&gt; M-l</li>
<li>Palabra siguiente, corta (kill-word) -&gt; M-d</li>
<li>Palabra, capitalizar (capitalize-word) -&gt; M-c</li>
<li>Párrafos, transponer (transpose-paragraphs)</li>
<li>Reemplazar ^M por un salto de línea &gt; M-x replace-string C-q C-m RET RET</li>
<li>Seleccionar todo -&gt; C-x h</li>
<li>Selección , corta (kill-region) -&gt; C-w</li>
<li>Selección a mayúsculas (upcase-region) -&gt; C-x C-u</li>
<li>Selección a minúsculas selección (downcase-region) -&gt; C-x C-u</li>
<li>Selección, capitalizar (upcase-initials-region)</li>
<li>Selección, copiar al anillo (kill-ring-save) -&gt; M-w</li>
<li>Selección, copiar selección, añadir (append-next-kill) -&gt; C-M-w</li>
</ul>
</div>
</div>
<div id="outline-container-org1c1da01" class="outline-3">
<h3 id="org1c1da01"><span class="section-number-3">2.9.</span> Evaluando código (org-babel)</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Comando python no encontrado: Añadir a init.el <code>(setq org-babel-python-command "python3")</code></li>
<li>Obtener resultados para "Print"-&gt; Declarar <code>#+BEGIN_SRC python :results output</code></li>
<li>Reemplazar Jupiter Notebook por Emacs Org Mode -&gt; <a href="https://michaelneuper.com/posts/replace-jupyter-notebook-with-emacs-org-mode/">Michael Neuper</a></li>
<li>Seleccionar los lenguajes a evaluar -&gt; Editar la variable <code>org-babel-load-languages</code></li>
</ul>
</div>
</div>

<div id="outline-container-org6e7cdc4" class="outline-3">
<h3 id="org6e7cdc4"><span class="section-number-3">2.10.</span> Macros</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li>Iniciar grabación de macro (start-kbd-macro) -&gt; &lt;f3&gt;  ò  C-x (</li>
<li>Parar grabación de macro (stop-kbd-macro) -&gt; &lt;f4&gt;  ò C-x )</li>
</ul>
</div>
</div>
<div id="outline-container-orged26152" class="outline-3">
<h3 id="orged26152"><span class="section-number-3">2.11.</span> MarkDown Mode</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li>Insertar encabezado -&gt; C-c C-s</li>
</ul>
</div>
</div>
<div id="outline-container-orgc360380" class="outline-3">
<h3 id="orgc360380"><span class="section-number-3">2.12.</span> Movimiento del cursor</h3>
<div class="outline-text-3" id="text-2-12">
<ul class="org-ul">
<li>Buffer, inicio/Fin de buffer &#x2013;&gt; M-&lt;/M-&gt;</li>
<li>Buffer, retornar a posición anterior &#x2013;&gt; C-u C-&lt;spc&gt;</li>
<li>Encabezado anterior mismo nivel (backward-same-level) -&gt; C-c C-b</li>
<li>Encabezado anterior (outline-previous-visible-heading) -&gt; C-c C-p</li>
<li>Encabezado inmediatamente superior (outline-up-heading) -&gt; C-c C-u</li>
<li>Encabezado siguiente mismo nivel (outline-forward-same-level) -&gt; C-c C-f</li>
<li>Encabezado siguiente (outline-up-heading) -&gt; C-c C-n</li>
<li>Línea, ir a línea determinada: M-g g (goto-line)</li>
<li>Línea, mover a la anterior: C-p</li>
<li>Línea, mover a la siguiente: C-n</li>
<li>Palabra, mueve a la anterior: M-b</li>
<li>Palabra, mueve a la siguiente: M-f</li>
<li>Paréntesis, llave o corchete, mueve al cierre: C-M-f</li>
<li>Paréntesis, llave o corchete, mueve a la apertura: C-M-b</li>
<li>Mueve al primer espacio no blanco -&gt; M-n</li>
<li>Scroll Abajo/Arriba &#x2013;&gt; C-v / M-v</li>
<li>Scroll Abajo/Arriba (Otra ventana) &#x2013;&gt; C-M-v / C-M-S-v (C-M&#x2013; C-M-v)</li>
<li>Scroll Horizontal &#x2013;&gt; C-x &lt; / C-x &gt;</li>
<li>Volver a la posición anterior &#x2013;&gt; C-u C-spc</li>
</ul>
</div>
</div>
<div id="outline-container-orgde885b8" class="outline-3">
<h3 id="orgde885b8"><span class="section-number-3">2.13.</span> Navegación</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>Abrir un directorio remoto ssh C-x d /ssh:user@host:folder</li>
<li>Abrir una url en buffer -&gt; browse-url-emacs</li>
</ul>
</div>
<div id="outline-container-orga11b837" class="outline-4">
<h4 id="orga11b837"><span class="section-number-4">2.13.1.</span> Ocur Mode (Buscar por líneas) M-x occur / M-s o</h4>
<div class="outline-text-4" id="text-2-13-1">
<ul class="org-ul">
<li>Sig/anterior coincidencia en bufer occur &#x2013;&gt; M-n M-p</li>
<li>Refrescar buffer &#x2013;&gt; g</li>
<li>Salir &#x2013;&gt; q</li>
<li>Editar en buffer ocur &#x2013;&gt; e</li>
<li>Guardar la edición &#x2013;&gt; C-c C-c</li>
<li>En varios buffers &#x2013;&gt; M-x multi-occur</li>
<li>En varios archivos (*.py) &#x2013;&gt; M-x multi-occur \</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5f70fa0" class="outline-3">
<h3 id="org5f70fa0"><span class="section-number-3">2.14.</span> Paquetes</h3>
<div class="outline-text-3" id="text-2-14">
<ul class="org-ul">
<li>Instalar paquete desde archivo -&gt; package-install-file</li>
<li>Yasnippet
<ul class="org-ul">
<li>Nuevo Snippet -&gt; yas-new-snippet</li>
<li>Editar Snippet -&gt; yas-visit-snippet-file</li>
<li>Ver snippets de un tipo de archivo -&gt; Alt+x yas-describe-tables</li>
<li>Configurar directorio de Snippets -&gt; (setq yas-snippet-dirs (list(concat user-dir "<i>dotfiles/emacs</i>.emacs.d/snippets")))
Sin el "list" no evalúa correctamente y no funciona.</li>
</ul></li>
<li><a href="emacs_dired.html#ID-acee2e7c-bdf2-4405-a41e-9ce7c9031d13">Dired</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd1c2c50" class="outline-3">
<h3 id="orgd1c2c50"><span class="section-number-3">2.15.</span> Repetir último comando (<a href="http://xahlee.info/emacs/emacs/emacs_repeat_command.html">Info</a>] -&gt; C-x z</h3>
</div>
<div id="outline-container-orga976e27" class="outline-3">
<h3 id="orga976e27"><span class="section-number-3">2.16.</span> Recuperar archivos -&gt; m-x recover-file</h3>
</div>
<div id="outline-container-org59b872c" class="outline-3">
<h3 id="org59b872c"><span class="section-number-3">2.17.</span> Selección</h3>
<div class="outline-text-3" id="text-2-17">
<ul class="org-ul">
<li>Activar la marca de posición -&gt; C-spc</li>
<li>Marcar el siguiente párrafo -&gt; M-h</li>
<li>Marcar todo el buffer -&gt; C-x h</li>
<li>Marcar una función -&gt; C-M-h</li>
<li>Marcar la siguiente palabra -&gt; M-@</li>
<li>Marcar las dos siguiente palabras - M-2 M-@</li>
<li>Marcar la siguiente expresión -&gt; C-M-@</li>
<li>Marcar desde el último punto de salto &#x2013;&gt; C-x C-x</li>
<li>Desactivar la marca -&gt; C-u C-&lt;spc&gt;</li>
</ul>
</div>
</div>
<div id="outline-container-org6e97116" class="outline-3">
<h3 id="org6e97116"><span class="section-number-3">2.18.</span> Shell</h3>
<div class="outline-text-3" id="text-2-18">
<ul class="org-ul">
<li>Abrir la consola de comandos -&gt; M-x shell</li>
<li>Ejecutar un archivo (executable-interpret) -&gt; C-c C-x</li>
<li>Abrir la terminal -&gt; M-x shell</li>
<li>Terminar la ejecución -&gt; C-c C-c</li>
<li>Ejecutar comando anterior -&gt; M-p</li>
<li><p>
Permitir la ejecución de alias (<a href="https://emacs.stackexchange.com/questions/56358/emacs-shell-not-picking-aliases-from-bashrc">Info</a>)
</p>
<div class="org-src-container">
<pre class="src src-elisp">(setq shell-command-switch "-ic")
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org031b916" class="outline-3">
<h3 id="org031b916"><span class="section-number-3">2.19.</span> Temas</h3>
<div class="outline-text-3" id="text-2-19">
<ul class="org-ul">
<li>Cambiar el tema -&gt; M-x customize-themes</li>
</ul>
</div>
</div>
<div id="outline-container-org462171d" class="outline-3">
<h3 id="org462171d"><span class="section-number-3">2.20.</span> Ventanas</h3>
<div class="outline-text-3" id="text-2-20">
<ul class="org-ul">
<li>Eliminar la ventana actual -&gt; C-x 0</li>
<li>Eliminar el resto de ventanas -&gt; C-x 1</li>
<li>División horizontal -&gt; C-x 2</li>
<li>División vertical -&gt; C-x 3</li>
<li>Cambio de ventanas con Ace-window
<ul class="org-ul">
<li>Instalar "ace-window" desde el repositorio de Melpa.</li>
<li>Añadir la línea "(global-set-key (kbd "M-o") 'ace-window)" al archivo de configuración.</li>
<li>Cambiar de ventana mediante M-o y el número que se deseb</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org87ad94d" class="outline-3">
<h3 id="org87ad94d"><span class="section-number-3">2.21.</span> Visualización</h3>
<div class="outline-text-3" id="text-2-21">
<ul class="org-ul">
<li>Ajuste de línea(cambiar) -&gt; toggle-truncate-lines</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-04 lun 12:33</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 12:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
